# Assignment 05

## Due: See Date in Moodle

## This Week's Assignment

In this week's assignment you'll be introdcued to Jupyter Notebooks, you'll learn how to:

- use `pandas` `DataFrame` and `Series` methods.

- perform data moves, such as filtering and grouping.

## Guidelines

- Follow good programming practices by using descriptive variable names, maintaining appropriate spacing for readability, and adding comments to clarify your code.

- Ensure written responses use correct spelling, complete sentences, and proper grammar.

**Name:**

**Section:**

**Date:**

Let's get started!

During the lecture, we discussed some data entry errors in the `skyscrapers_world.csv` dataset. In this notebook, we will further correct these errors and apply data moves, such as filtering, summarizing, and grouping, to gain deeper insights into the buildings contained in the dataset.

**Question 1.** Import the `pandas` library with the appropriate alias and load the `skyscrapers_world.csv` dataset from the `data` folder into a `pandas` `DataFrame` named `ss`. Display the first five rows to verify that the data loaded correctly.

**Note:** Use separate code cells, one for importing the library and another for loading the dataset.

In [60]:
## Import the pandas library
...

In [61]:
## Load the dataset
...

,Unnamed: 0,name,city,country,status.started,status.completed,height in meters,height,floors,material,function
0,1,Burj Khalifa,Dubai,UAE,2009,2010,"2,722","2,722 ft",163,steel/concrete,variety
1,2,Shanghai Tower,Shanghai,China,2008,2014,2073,2073 ft,128,composite,"Misc, Cultural Monument"
2,3,Makkah Royal Clock Tower,Mecca,Saudi Arabia,2002,2012,601,601 m / 1972 ft,120,steel/concrete,Clock/Retail/Hotel/Residential
3,4,Ping An Finance Center,Shenzhen,China,2010,2017,599.1,599.1 m / 1965 ft,115,composite,Office/Retail/Hotel
4,5,Lotte World Tower,Seoul,South Korea,2012,2017,554.5,"554.5 m / 1,819 ft",123,composite,hotel / residential / office / retail

Let's examine the metadata for the `ss` DataFrame. In the code cell below, run the `ss.info()` command to display column names, data types, and non-null counts.

**Note:** Metadata refers to data about the data, such as column names, data types, missing values, and overall structure. Reviewing metadata helps ensure data integrity and guides preprocessing steps.

In [62]:
ss.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        102 non-null    int64
 1   name              102 non-null    object
 2   city              100 non-null    object
 3   country           102 non-null    object
 4   status.started    100 non-null    object
 5   status.completed  102 non-null    object
 6   height in meters  102 non-null    object
 7   height            102 non-null    object
 8   floors            102 non-null    object
 9   material          102 non-null    object
 10  function          102 non-null    object
dtypes: int64(1), object(10)
memory usage: 8.9+ KB

**Question 2.** Refer to **Examples 1 and 2** in the `Week 8 lecture notebook` to:  

- Remove the `Unnamed: 0` column.  

- Rename the columns `status.started`, `status.completed`, and `height in meters`, converting them to `snake_case`.

In separate code cells confirm that your processing has produced the expected results.

**Note:** Feel free to add separate code cells for each step. Be sure to include comments in each cell to clearly describe the purpose of the code.

In [63]:
...

In [64]:
...

Index(['name', 'city', 'country', 'status.started', 'status.completed',
       'height in meters', 'height', 'floors', 'material', 'function'],
      dtype='object')

In [65]:
...

In [66]:
...

Index(['name', 'city', 'country', 'year_started', 'year_completed',
       'height_meters', 'height', 'floors', 'material', 'function'],
      dtype='object')

**Question 3.** Refer to **Example 3** in the `Week 8 lecture notebook` to convert the `height in meters` column from a string to a float. Then, add the cleaned values to the `ss` `DataFrame` as a new column named `clean_height_meters`.

In a separate code cell confirm that your processing has produced the expected results.

**Note:** Feel free to add separate code cells for each step. Be sure to include comments in each cell to clearly describe the purpose of the code.

In [67]:
...

In [68]:
...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 102 non-null    object
 1   city                 100 non-null    object
 2   country              102 non-null    object
 3   year_started         100 non-null    object
 4   year_completed       102 non-null    object
 5   height_meters        102 non-null    object
 6   height               102 non-null    object
 7   floors               102 non-null    object
 8   material             102 non-null    object
 9   function             102 non-null    object
 10  clean_height_meters  102 non-null    float64
dtypes: float64(1), object(10)
memory usage: 8.9+ KB

**Question 4.** Refer to **Example 5** in the `Week 8 lecture notebook` to correct any text entries in the `floors` column. Replace these incorrect values with the appropriate numerical values based on the dataset. Then, convert the `floors` column to a numeric data type.

In a separate code cell confirm that your processing has produced the expected results.

**Note:** Feel free to add separate code cells for each step. Be sure to include comments in each cell to clearly describe the purpose of the code.

In [69]:
...

In [70]:
...

In [71]:
...

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   name                 102 non-null    object
 1   city                 100 non-null    object
 2   country              102 non-null    object
 3   year_started         100 non-null    object
 4   year_completed       102 non-null    object
 5   height_meters        102 non-null    object
 6   height               102 non-null    object
 7   floors               102 non-null    int64
 8   material             102 non-null    object
 9   function             102 non-null    object
 10  clean_height_meters  102 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 8.9+ KB

In [72]:
print(ss.loc[48, 'floors'])
print(ss.loc[61, 'floors'])

103
73

**Question 5.** Use the `.value_counts()` method to generate a frequency table of country names, showing the count of occurrences for each unique country.

In [73]:
...

China                         50
United Arab Emirates          12
United States of America       9
Russia                         5
South Korea                    3
USA                            3
Taiwan                         2
United Arab Emirates (UAE)     2
Malasya                        2
Malaysia                       2
Dubai                          1
Germany                        1
US                             1
United Sates of America        1
saudi Arabia                   1
UAE                            1
Shenzhen                       1
Kuwait                         1
Vietnam                        1
New York                       1
Saudi Arabia                   1
Spain                          1
Name: country, dtype: int64

The code

```python
ss['country'].value_counts()
```

executed without any errors, but the output is incorrect because the same country has been entered in different ways, leading to inconsistent results. For instance:

- USA, US, United Sates of America, and United States of America are listed separately, though they refer to the same country.

- United Arab Emirates appears multiple times as United Arab Emirates (UAE) and UAE.

- Malaysia is misspelled as Malasya.

- Saudi Arabia is listed as saudi Arabia (with a lowercase "s").

- Shenzhen is a Province in China, not a country.

- New York is a city in the United States of America, not a country.

- Dubai is a city in the United Arab Emirates, not a country.

We aim to compare summary statistics for the top three countries in the dataset: China, the United Arab Emirates, and the United States. To ensure an accurate comparison, we must first standardize the country names.

## Making Choices

In this section, you will choose a categorical label of your preference. For brevity and clarity, I will demonstrate a method to label all buildings in the United Arab Emirates as **UAE**. You can use this method as shown or choose an alternative approach to label buildings in China and the United States. 

### Filter the Data

First we need all the rows that should be labeled UAE.

1. A list named `uae` is created that contains different variations of how the United Arab Emirates may appear in the dataset.

```python
uae = ["United Arab Emirates", "United Arab Emirates (UAE)", "Dubai", "UAE"]
```

2. The `.isin(uae)` method checks if each value in the `country` column exists in the `uae` list. This results in a boolean maskâ€”a series of `True` and `False` values:

   - `True`: The country name is in the `uae list.

   - `False`: The country name is not in the `uae` list.
   
```python
mask = ss['country'].isin(uae)
```

3.  Filter `DataFrame` to only include rows where mask is `True` (i.e., where country matches one of the values in `uae`). Then select only the `country` column from these filtered rows. This displays the results but does not modify the original `ss` `DataFrame`.

```python
ss[mask]['country']
```

In [74]:
uae = ["United Arab Emirates", "United Arab Emirates (UAE)", "Dubai", "UAE"]
mask = ss['country'].isin(uae)
ss[mask]['country']

0                            UAE
28          United Arab Emirates
32          United Arab Emirates
39                         Dubai
47          United Arab Emirates
49          United Arab Emirates
55          United Arab Emirates
61          United Arab Emirates
63          United Arab Emirates
64    United Arab Emirates (UAE)
65    United Arab Emirates (UAE)
66          United Arab Emirates
70          United Arab Emirates
81          United Arab Emirates
96          United Arab Emirates
98          United Arab Emirates
Name: country, dtype: object

### `.index`

The `.index` attribute in `pandas` returns the index labels of a `DataFrame` or `Series`. It allows you to access the row labels (or numerical index positions if not explicitly set) for filtering, iteration, and modification.

4. Filter `DataFrame` to only include rows where mask is `True` (i.e., where country matches one of the values in `uae`). Then select only the `country` column from these filtered rows and extracts the index values of these `rows`.

```python
rows = ss[mask]['country'].index
```

In [75]:
rows = ss[mask]['country'].index
rows

Int64Index([0, 28, 32, 39, 47, 49, 55, 61, 63, 64, 65, 66, 70, 81, 96, 98], dtype='int64')

5. A `for` loop iterates over each index value stored in `rows`, processing one item at a time.

```python
for i in rows:
```

6. `ss.loc[i, 'country']` accesses the country name in the row with index `i`. This value is stored in `previous_label` to keep track of what the country name was before the update.

```python
    previous_label = ss.loc[i, 'country']
```

7. `ss.loc[i, 'country'] = "UAE"` replaces the value in the country column at row index i with "UAE", standardizing all variations to a single label.

```python
    ss.loc[i, 'country'] = "UAE"
```

8. `print()` outputs the index, the original country name, and the new updated name. This statement uses an f-string to format the output with proper spacing for readability.

```python
print(f"Row index: {i:<5} Previous label: {previous_label:<30} New label: {ss.loc[i, 'country']:<20}")
```

 - `{i:<5}`: Prints `i` (row index), left-aligned in a 5-character space.

 - `{previous_label:<30}`: Prints the old country name, left-aligned in a 30-character space.
 
 - `{ss.loc[i, 'country']:<20}`: Prints the new country name, left-aligned in a 20-character space.

**Question 6.** Run the cell below.

In [77]:
for i in rows:
    previous_label = ss.loc[i, 'country']
    ss.loc[i, 'country'] = "UAE"
    print(f"Row index: {i:<5} Previous label: {previous_label:<30} New label: {ss.loc[i, 'country']:<20}")

Row index: 0     Previous label: UAE                            New label: UAE
Row index: 28    Previous label: United Arab Emirates           New label: UAE
Row index: 32    Previous label: United Arab Emirates           New label: UAE
Row index: 39    Previous label: Dubai                          New label: UAE
Row index: 47    Previous label: United Arab Emirates           New label: UAE
Row index: 49    Previous label: United Arab Emirates           New label: UAE
Row index: 55    Previous label: United Arab Emirates           New label: UAE
Row index: 61    Previous label: United Arab Emirates           New label: UAE
Row index: 63    Previous label: United Arab Emirates           New label: UAE
Row index: 64    Previous label: United Arab Emirates (UAE)     New label: UAE
Row index: 65    Previous label: United Arab Emirates (UAE)     New label: UAE
Row index: 66    Previous label: United Arab Emirates           New label: UAE
Row index: 70    Previous label: United Arab Emirates           New label: UAE
Row index: 81    Previous label: United Arab Emirates           New label: UAE
Row index: 96    Previous label: United Arab Emirates           New label: UAE
Row index: 98    Previous label: United Arab Emirates           New label: UAE

Now that the labels for the UAE have been corrected, we will now standardize the labels for buildings in China.

Run the cell below to use the `.query()` method to locate the row where the country label is Shenzhen.

In [56]:
q = "country == 'Shenzhen'"

ss.query(q)

,name,city,country,year_started,year_completed,height_meters,height,floors,material,function,clean_height_meters
38,China Resources Tower,NaN,Shenzhen,2012,2018,392.5,"392.5 m / 1,288 ft",68,composite,office,392.5

**Question 7.** Correct the mislabeled entry by changing Shenzhen to China.

In a separate code cell confirm that your processing has produced the expected results.

In [57]:
...

In [58]:
...

name                   China Resources Tower
city                                     NaN
country                                China
year_started                            2012
year_completed                          2018
height_meters                          392.5
height                    392.5 m / 1,288 ft
floors                                    68
material                           composite
function                              office
clean_height_meters                    392.5
Name: 38, dtype: object

**Question 8.** Standardize the labels for buildings in the United States. You can choose your preferred label, such as US, USA, United States, or United States of America.In a separate code cell confirm that your processing has produced the expected results.

In a separate code cell confirm that your processing has produced the expected results.

**Note:** Feel free to add separate code cells for each step. Be sure to include comments in each cell to clearly describe the purpose of the code.

In [78]:
...

Row index: 22    Previous label: United States of America       New label: USA
Row index: 25    Previous label: United States of America       New label: USA
Row index: 26    Previous label: United States of America       New label: USA
Row index: 27    Previous label: United States of America       New label: USA
Row index: 29    Previous label: United States of America       New label: USA
Row index: 42    Previous label: United States of America       New label: USA
Row index: 48    Previous label: United Sates of America        New label: USA
Row index: 60    Previous label: United States of America       New label: USA
Row index: 79    Previous label: US                             New label: USA
Row index: 86    Previous label: United States of America       New label: USA
Row index: 97    Previous label: United States of America       New label: USA

**Question 9.** Filter the `ss` `DataFrame` to include only rows where the country is China, UAE, or USA. Save the filtered DataFrame as `dat`.

In a separate code cell confirm that your processing has produced the expected results.

In [82]:
q = ...

dat = ...

array(['UAE', 'China', 'USA'], dtype=object)

In [ ]:
...

Run the cell below.

In [83]:
dat.groupby('country')['clean_height_meters'].describe()

,count,mean,std,min,25%,50%,75%,max
country,,,,,,,,
China,50.0,505.334000,354.284544,35.6,339.600,378.65,451.575,2073.0
UAE,16.0,568.550000,615.467698,335.1,353.950,358.15,397.650,2722.0
USA,14.0,566.414286,331.344480,335.3,371.125,426.35,464.875,1250.0

**Question 10.** Analyze the output from the previous command and summarize your observations in a paragraph. Highlight any interesting patterns, trends, or anomalies you notice in the data. Consider factors such as frequency, distribution, or any unexpected values that stand out.

_TYPE YOUR ANSWET HERE REPLACING THIS TEXT_

## Submission

Make sure that all cells in your assignment have been executed to display all output, images, and graphs in the final document.

**Note:** Save the assignment before proceeding to download the file.

After downloading, locate the `.ipynb` file and upload **only** this file to Moodle. The assignment will be automatically submitted to Gradescope for grading.